Revit 2027 API
ExporterIFC.GetDoorWindowOpeningHandle Method
 Get the handle to the opening associated with a hosted (door/window) element from the internal cache.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAnyHandle GetDoorWindowOpeningHandle(
	ElementId familyInstanceId
)
Public Function GetDoorWindowOpeningHandle (
	familyInstanceId As ElementId
) As IFCAnyHandle
public:
IFCAnyHandle^ GetDoorWindowOpeningHandle(
	ElementId^ familyInstanceId
)
member GetDoorWindowOpeningHandle :
        familyInstanceId : ElementId -> IFCAnyHandle
Parameters
familyInstanceId ElementId
 The id of the door or window.
Return Value
IFCAnyHandle
 The opening handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace